
export const ERRORS = {
  SCENARIO: {
    EXISTED: 'Сценарий с таким именем уже существует',
    INVALID: 'Сценарий с таким именем не найден',
  },
  GAME: {
    INVALID: 'Игра с таким ID не найдена',
    ALREADY_PLAYING: 'Вы уже играете в другой игре',
    FULL: 'В игре нет свободных мест',
    STARTED: 'Игра уже началась',
    ENDED: 'Игра уже закончилась',
    INVALID_PASSWORD: 'Неверный пароль',
    COMPANY_EXISTED: 'Компания с таким именем уже создана',
    NOT_PLAYING: 'Вы не играете в этой игре',
    SOLUTIONS: 'Вы не можете отправлять решения за период',
  },
  USER: {
    EXISTED: {
      NAME: 'Пользователь с таким никнеймом уже существует',
      EMAIL: 'Пользователь с таким email адресом уже существует',
    },
    INVALID_PASSWORD: 'Неверный никнейм или пароль',
    SOCIAL: 'Аккаунт зарегистрирован через социальные сети',
  },
  ADMIN: {
    PERMISSIONS: 'У вас недостаточно прав для совершения этого действия',
  },
};
